[
    {
        "clause_id": "Section 3",
        "title": "Personal Data",
        "summary": "This section defines what constitutes personal data under the Digital Personal Data Protection Act, including any information that can be used to identify an individual, either directly or indirectly. It also outlines the types of personal data that are protected, such as names, addresses, and financial information."
    },
    {
        "clause_id": "Section 5",
        "title": "Data Fiduciary",
        "summary": "This section introduces the concept of a data fiduciary, which refers to any person who determines the purpose and means of processing personal data. It outlines the responsibilities of data fiduciaries, including ensuring that personal data is processed in a fair and transparent manner."
    },
    {
        "clause_id": "Section 8",
        "title": "Notice and Consent",
        "summary": "This section requires data fiduciaries to provide individuals with clear notice about the collection and use of their personal data, and to obtain their consent before processing such data. It also outlines the requirements for valid consent, including that it must be informed, specific, and freely given."
    },
    {
        "clause_id": "Section 10",
        "title": "Data Protection Rights",
        "summary": "This section outlines the rights of individuals with respect to their personal data, including the right to access, correct, and erase their data. It also provides individuals with the right to object to the processing of their data and to restrict its use."
    },
    {
        "clause_id": "Section 12",
        "title": "Data Breach Notification",
        "summary": "This section requires data fiduciaries to notify individuals and the relevant authorities in the event of a data breach, which is defined as any unauthorized access, disclosure, or loss of personal data. It outlines the requirements for breach notification, including the timing and content of such notices."
    },
    {
        "clause_id": "Section 15",
        "title": "Data Localization",
        "summary": "This section requires data fiduciaries to store personal data within the country, except in certain circumstances where cross-border data transfers are permitted. It outlines the requirements for cross-border data transfers, including the need for adequate safeguards to protect the data."
    },
    {
        "clause_id": "Section 17",
        "title": "Exemptions",
        "summary": "This section outlines the exemptions from the Act, including exemptions for certain types of processing, such as processing for national security or law enforcement purposes. It also provides exemptions for small entities and startups, subject to certain conditions."
    },
    {
        "clause_id": "Section 20",
        "title": "Penalties",
        "summary": "This section outlines the penalties for non-compliance with the Act, including fines and imprisonment for serious offenses. It also provides for administrative penalties, such as warnings and orders to comply with the Act."
    },
    {
        "clause_id": "Section 22",
        "title": "Data Protection Officer",
        "summary": "This section requires data fiduciaries to appoint a data protection officer, who is responsible for ensuring compliance with the Act. It outlines the qualifications and responsibilities of the data protection officer, including monitoring data processing activities and providing advice to the data fiduciary."
    },
    {
        "clause_id": "Section 25",
        "title": "Codes of Practice",
        "summary": "This section provides for the development of codes of practice, which are guidelines that provide further guidance on the implementation of the Act. It outlines the process for developing codes of practice, including consultation with stakeholders and approval by the relevant authority."
    },
    {
        "clause_id": "Section 28",
        "title": "Complaints and Appeals",
        "summary": "This section outlines the process for making complaints and appeals under the Act, including the right to complain to the data fiduciary or the relevant authority. It also provides for the right to appeal decisions of the authority to a higher court or tribunal."
    },
    {
        "clause_id": "Section 30",
        "title": "Regulations",
        "summary": "This section provides for the making of regulations to implement the Act, including regulations on specific aspects of data protection such as data breach notification and cross-border data transfers. It outlines the process for making regulations, including consultation with stakeholders and approval by the relevant authority."
    },
    {
        "clause_id": "Section 32",
        "title": "Review and Revision",
        "summary": "This section requires the relevant authority to review the Act regularly and revise it as necessary to ensure that it remains effective and up-to-date. It outlines the process for review and revision, including consultation with stakeholders and approval by the relevant authority."
    },
    {
        "clause_id": "Section 35",
        "title": "Transitional Provisions",
        "summary": "This section provides for transitional provisions to facilitate the implementation of the Act, including provisions on the treatment of existing personal data and the phased implementation of certain requirements. It outlines the process for transitioning to the new regime, including the deadlines for compliance and the consequences of non-compliance."
    },
    {
        "clause_id": "Section 38",
        "title": "Savings and Repeal",
        "summary": "This section provides for the savings and repeal of existing laws and regulations, including laws and regulations that are inconsistent with the Act. It outlines the process for repealing existing laws and regulations, including the timing and effect of such repeal."
    },
    {
        "clause_id": "Section 40",
        "title": "Amendments",
        "summary": "This section provides for the amendment of the Act, including the process for introducing amendments and the requirements for approval. It outlines the process for amending the Act, including consultation with stakeholders and approval by the relevant authority."
    },
    {
        "clause_id": "Section 42",
        "title": "Short Title and Commencement",
        "summary": "This section provides for the short title and commencement of the Act, including the date on which the Act comes into force. It outlines the process for bringing the Act into force, including the publication of a notice in the official gazette and the commencement of the Act on a specified date."
    },
    {
        "clause_id": "Section 45",
        "title": "User Rights",
        "summary": "This section outlines the rights of users with respect to their personal data, including the right to access, correct, and erase their data. It also provides users with the right to object to the processing of their data and to restrict its use."
    },
    {
        "clause_id": "Section 48",
        "title": "Data Fiduciary Obligations",
        "summary": "This section outlines the obligations of data fiduciaries, including the obligation to ensure that personal data is processed in a fair and transparent manner. It also provides for the obligation to implement appropriate technical and organizational measures to protect personal data."
    },
    {
        "clause_id": "Section 50",
        "title": "Cross-Border Data Transfers",
        "summary": "This section outlines the requirements for cross-border data transfers, including the need for adequate safeguards to protect the data. It provides for the use of model contracts, binding corporate rules, and other mechanisms to facilitate cross-border data transfers."
    }
]